app/Models/Comment.php

select * from `comments` where `tweet_id` = 1 and `comments`.`deleted_at` is null
select * from `users` where `users`.`id` in (1, 11, 12)
---
    public function getComments(Int $tweet_id)
    {
        return $this->with('user')->where('tweet_id',$tweet_id)->get();