app/Models/Favorite.php

    public function isFavorite(Int $user_id, Int $tweet_id)
    {
        return (boolean) $this->where('user_id',$user_id)->where('tweet_id',$tweet_id)->first();
---
select * from `favorites` where `user_id` = 11 and `tweet_id` = 13 limit 1

    public function storeFavorite(Int $user_id, Int $tweet_id)
    {
        $this->user_id = $user_id;
        $this->tweet_id = $tweet_id;
        $this->save();
---
insert into `favorites` (`user_id`, `tweet_id`) values (11, 13)

    public function destroyFavorite(Int $favorite_id)
    {
        return $this->where('id',$favorite_id)->delete();
---
delete from `favorites` where `id` = 116