app/Models/Follower.php

select `followed_id` from `followers` where `following_id` = 11
---
    public function followingIds(Int $user_id)
    {
        return $this->where('following_id',$user_id)->get('followed_id');