app/Models/Tweet.php

    public function getTweetCount(Int $user_id)
    {
        return $this->where('user_id',$user_id)->count();
---
select count(*) as aggregate from `tweets` where `user_id` in (1, 2, 3, 4, 5, 6, 7, 8, 10, 12, 11)

    public function getTimeLines(Int $user_id,Array $follow_ids)
    {
        #自分とフォローしているユーザーIDを結合
        $follow_ids[] = $user_id;
        return $this->whereIn('user_id',$follow_ids)->orderBy('created_at','DESC')->paginate(50);
---
select * from `tweets` where `user_id` in (1, 2, 3, 4, 5, 6, 7, 8, 10, 12, 11) and `tweets`.`deleted_at` is null order by `created_at` desc limit 50 offset 0

    public function getTweet(Int $tweet_id)
    {
        return $this->with('user')->where('id', $tweet_id)->first();
---
select * from `tweets` where `id` = 1 and `tweets`.`deleted_at` is null limit 1
select * from `users` where `users`.`id` in (1)

    public function tweetStore(Int $user_id, Array $data)
    {
        #格納してる
        $this->user_id = $user_id;
        $this->text = $data['text'];
        $this->save();
---
insert into `tweets` (`user_id`, `text`, `updated_at`, `created_at`) values (11, '借金', '2020-03-05 03:43:26', '2020-03-05 03:43:26')

    public function tweetDestroy(Int $user_id, Int $tweet_id)
    {
        return $this->where('user_id',$user_id)->where('id',$tweet_id)->delete();
---
delete from `tweets` where `user_id` = 11 and `id` = 14