app/Models/User.php

    public function getAllUsers(Int $user_id)
    {
        return $this->where('id','<>',$user_id)->paginate(5);
---
select * from `users` where `id` <> 11 limit 5 offset 0
select count(*) as aggregate from `users` where `id` <> 11